<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>Present simple, Present continuous, State verbs</title>
    <style type="text/css">
      body {
        font-family: Tahoma, Geneva, Verdana, sans-serif;
        font-size: 15px;
        margin: 0 auto;
        padding: 0 0 0 10px;
        width: 650px;
      }
    </style>
  </head>
  <body>
    <div>
      <h1 style="text-align: center">
        Unit 2: Past simple, Past continuous, Use to &amp; Would
      </h1>
      <hr />
      <p>
        <strong>&nbsp;➥ Bạn học lại b&agrave;i học cũ:&nbsp;</strong
        ><span style="color: #0000ff"
          ><strong
            ><a
              style="color: #0000ff"
              href="Unit 1. Present simple, Present continuous, State verbs.html"
              >Unit 1: Present simple, Present continuous, State verbs</a
            ></strong
          ></span
        >
      </p>
      <h2>
        <span style="color: #ff0000"
          ><strong>I. PAST SIMPLE - QU&Aacute; KHỨ ĐƠN</strong></span
        >
      </h2>
      <p>
        <strong><u>1.&nbsp;</u></strong
        ><strong><u>Cấu tr&uacute;c</u></strong>
      </p>
      <p><u>C&acirc;u khẳng định</u></p>
      <p>- S + V-ed/P1 (+ O)</p>
      <ul>
        <li>She came back last Friday.</li>
        <li>They were in London from Monday to Thursday of last week.</li>
      </ul>
      <p><u>C&acirc;u phủ định</u></p>
      <p>- S + did not/didn't + V (+ O)</p>
      <p>V&iacute; dụ:</p>
      <ul>
        <li>She didn't come back last Friday</li>
        <li>They were not in London from Monday to Thursday of last week.</li>
      </ul>
      <p><u>C&acirc;u nghi vấn</u></p>
      <p>- (Từ để hỏi) + did not/didn't + V + (O)</p>
      <p>- (Từ để hỏi) + did + V + not + (O)</p>
      <p>V&iacute; dụ:</p>
      <ul>
        <li>When did she come back?</li>
        <li>Were they in London from Monday to Thursday of last week?</li>
      </ul>
      <p>&nbsp;</p>
      <p>
        <strong><u>2. C&aacute;ch d&ugrave;ng</u></strong>
      </p>
      <p>
        Th&igrave; qu&aacute; khứ đơn (The simple past) được d&ugrave;ng để diễn
        tả :
      </p>
      <p>
        <strong
          >-&nbsp;Sự việc diễn ra trong một thời gian cụ thể trong qu&aacute;
          khứ v&agrave; đ&atilde; kết th&uacute;c ở hiện tại:</strong
        >
      </p>
      <ul>
        <li>She came back last Friday.</li>
        <li>I saw her in the street.</li>
      </ul>
      <p>
        <strong
          >- Sự việc diễn ra trong một khoảng thời gian trong qu&aacute;
          khứ&nbsp;v&agrave; đ&atilde; kết th&uacute;c ở hiện tại:</strong
        >
      </p>
      <ul>
        <li>She lived in Tokyo for seven years.</li>
        <li>They were in London from Monday to Thursday of last week.</li>
      </ul>
      <p>
        <strong
          ><em
            ><u
              >C&aacute;c cụm từ thường d&ugrave;ng với th&igrave; qu&aacute;
              khứ đơn:</u
            ></em
          ></strong
        >
      </p>
      <ul>
        <li>Yesterday</li>
        <li>(two days, three weeks) ago</li>
        <li>last (year, month, week)</li>
        <li>in (2002, June)</li>
        <li>from (March) to (June)</li>
        <li>in the (2000, 1980s)</li>
        <li>in the last century</li>
        <li>in the past</li>
      </ul>
      <p>&nbsp;</p>
      <p style="text-align: justify">
        Th&igrave; qu&aacute; khứ đơn được ứng dụng nhiều trong b&agrave;i thi
        IELTS. Bạn cần sử dụng đến th&igrave; n&agrave;y khi diễn tả những sự
        việc, c&acirc;u chuyện được diễn ra trong qu&aacute; khứ đặc biệt ở
        Speaking v&agrave; Writing.<strong
          >&nbsp;N&ecirc;n c&aacute;c bạn cần nắm vững nh&eacute;!</strong
        >
      </p>
      <h3>
        <span style="color: #ff0000"
          ><strong>II. PAST CONTINUOUS - QU&Aacute; KHỨ TIẾP DIỄN</strong></span
        >
      </h3>
      <p>
        <strong><u>1. Cấu tr&uacute;c</u></strong>
      </p>
      <p><u>C&acirc;u khẳng định</u></p>
      <p>- S + was/were + V-ing (+ O)</p>
      <p>V&iacute; dụ:</p>
      <ul>
        <li>We were just talking about it before you arrived.</li>
      </ul>
      <p><u>C&acirc;u phủ định</u></p>
      <p>- S + was/were + not + V-ing (+ O)</p>
      <p>V&iacute; dụ:</p>
      <ul>
        <li>We were not talking about it before you arrived.</li>
      </ul>
      <p><u>C&acirc;u nghi vấn</u></p>
      <p>- (Từ để hỏi) + was/were + S + V-ing (+ O)?</p>
      <p>V&iacute; dụ:</p>
      <ul>
        <li>What were you just talking about before I arrived?</li>
      </ul>
      <p>
        <strong><u>2. C&aacute;ch d&ugrave;ng</u></strong>
      </p>
      <p>
        <strong
          >Ch&uacute;ng ta d&ugrave;ng th&igrave; qu&aacute; khứ tiếp diễn khi
          muốn nhấn mạnh diễn biến hay qu&aacute; tr&igrave;nh của sự vật hay sự
          việc hoăc thời gian sự vật hay sự việc đ&oacute; diễn ra.</strong
        >
      </p>
      <ul>
        <li>
          While I was driving home, Peter was trying desperately to contact me.
        </li>
        <li>Were you expecting any visitors?</li>
      </ul>
      <p>
        <strong
          >Ch&uacute;ng ta d&ugrave;ng th&igrave; qu&aacute; khứ tiếp diễn để
          diễn tả 1 h&agrave;nh động đang diễn ra trong qu&aacute; khứ
          th&igrave; c&oacute; h&agrave;nh động kh&aacute;c xen
          v&agrave;o.</strong
        >
      </p>
      <ul>
        <li>I was walking in the street when I suddenly fell over.</li>
        <li>
          I was making a presentation in front of 500 people when the microphone
          stopped working.
        </li>
      </ul>
      <p><strong>Non-continuous verbs</strong></p>
      <p>
        C&oacute; những động từ kh&ocirc;ng bao giờ được d&ugrave;ng
        &ldquo;ing&rdquo;
      </p>
      <p>
        Đ&acirc;y thường l&agrave; những động từ m&agrave; ta kh&ocirc;ng thể
        nh&igrave;n thấy h&agrave;nh động của chủ thể ( want &ndash; muốn, need
        &ndash; cần &hellip;)
      </p>
      <table style="border-collapse: collapse" border="-">
        <tbody>
          <tr>
            <td>
              <p style="text-align: center">
                <strong>Non-continuous verb</strong>
              </p>
            </td>
            <td>
              <p style="text-align: center"><strong>Example</strong></p>
            </td>
          </tr>
          <tr>
            <td>
              <p style="padding-left: 30px">
                <strong><em>Abstract verbs</em></strong
                >&nbsp;: động từ trừu tượng
              </p>
            </td>
            <td style="padding-left: 30px">
              <p style="padding-left: 30px">
                To be, to want , to seem, to care, to exist&hellip;
              </p>
            </td>
          </tr>
          <tr style="padding-left: 30px">
            <td style="padding-left: 30px">
              <p>
                <strong><em>Possession verbs</em></strong
                >&nbsp;: động từ chỉ sở hữu
              </p>
            </td>
            <td style="padding-left: 30px">
              <p style="padding-left: 30px">To own, to belong, to possess</p>
            </td>
          </tr>
          <tr style="padding-left: 30px">
            <td style="padding-left: 30px">
              <p>
                <strong><em>Emotion verbs</em></strong
                >&nbsp;: động từ chỉ cảm x&uacute;c
              </p>
            </td>
            <td style="padding-left: 30px">
              <p style="padding-left: 30px">
                To love, to like , to dislike, to fear , to mind ,&hellip;
              </p>
            </td>
          </tr>
        </tbody>
      </table>
      <p>
        Ex : We have loved each other for 5 years ( = we still love each other
        now)
      </p>
      <p>
        NOT : We have been loving each other for 5 years ( = we are still loving
        each other now)
      </p>
      <h4>
        <span style="color: #ff0000"
          ><strong>III. USED TO + V(inf)</strong></span
        >
      </h4>
      <p><strong>1. "Used to inf" </strong></p>
      <p>
        <strong
          >Đ&acirc;y l&agrave; cấu tr&uacute;c c&acirc;u nổi bật được sử dụng để
          diễn tả 1 sự việc thường xuy&ecirc;n diễn ra trong qu&aacute; khứ
          nhưng hiện tại th&igrave; kh&ocirc;ng c&ograve;n nữa.</strong
        >
      </p>
      <p>
        <span style="text-decoration: underline"
          ><strong>V&iacute; dụ</strong></span
        >
      </p>
      <p>
        I used to smoke a packet a day but I stopped two years ago. ( trước
        đ&acirc;y t&ocirc;i h&uacute;t 1 g&oacute;i thuốc 1 ng&agrave;y nhưng từ
        2 năm trở lại đ&acirc;y t&ocirc;i kh&ocirc;ng h&uacute;t thuốc nữa)
      </p>
      <p>
        Ben used to travel a lot in his job but now, since his promotion, he
        doesn't. ( Ben thường đi du lịch rất nhiều khi l&agrave;m c&ocirc;ng
        việc trước đ&acirc;y, nhưng từ khi anh ấy lu&acirc;n chuyển c&ocirc;ng
        việc th&igrave; kh&ocirc;ng c&ograve;n nữa).
      </p>
      <p>
        Với thể khẳng định v&agrave; nghi vấn, bạn sử dụng c&ocirc;ng thức với
        Used to như sau:
      </p>
      <p>- Did you use to be a teacher?</p>
      <p>- Did he use to study French?</p>
      <p>- She didn't use to like chocolate, but she does now.</p>
      <p>- I didn't use to want to have a nice house.</p>
      <p>
        Sử dụng Use to + V th&igrave; kh&ocirc;ng c&oacute; tobe. Ch&uacute;ng
        ta kh&ocirc;ng thể n&oacute;i:&nbsp;I am used to have long hair<br /><br /><span
          style="background-color: #ffff00"
        >
          <strong>Cần ch&uacute; &yacute; l&agrave;</strong></span
        >
        'Used to do' th&igrave; kh&aacute;c 'to be used to doing' v&agrave; 'to
        get used to doing'<br /><br /><strong
          >2. To be used to doing ( Be used to Ving)</strong
        >
      </p>
      <p>
        Ta d&ugrave;ng cấu tr&uacute;c 'to be used to doing' để diễn tả những
        h&agrave;nh động, sự việc diễn ra thường xuy&ecirc;n, th&oacute;i quen ở
        hiện tại.<br /><br /><strong>V&iacute; dụ</strong>
      </p>
      <p>
        - I'm used to living on my own. I've done it for quite a long time.
        (T&ocirc;i thường ở 1 m&igrave;nh, v&agrave; t&ocirc;i đ&atilde; ở một
        m&igrave;nh được một khoảng thời gian kh&aacute; l&acirc;u)
      </p>
      <p>
        - Hans has lived in England for over a year so he is used to driving on
        the left now. (Hans đ&atilde; sống ở Anh hơn 1 năm rồi n&ecirc;n giờ anh
        ấy quen l&aacute;i xe b&ecirc;n tay tr&aacute;i)
      </p>
      <p>
        <strong
          >Với phủ định, thể hiện người đ&oacute; &iacute;t l&agrave;m,
          kh&ocirc;ng thực hiện h&agrave;nh động đ&oacute; th&agrave;nh
          th&oacute;i quen:</strong
        >
      </p>
      <p>
        - Lucy isn't used to staying up late, so she's very tired today. - Lucy
        kh&ocirc;ng quen thức khuya n&ecirc;n c&ocirc; ấy rất mệt h&ocirc;m nay.
      </p>
      <p>
        - Are your children used to walking a lot? - Con bạn c&oacute; hay đi bộ
        kh&ocirc;ng?
      </p>
      <p>
        <strong
          >Bạn c&oacute; thể sử dụng be used to + N với &yacute; nghĩa quen
          thuộc như tr&ecirc;n:</strong
        >
      </p>
      <p>
        - It was difficult when I first started university, because I wasn't
        used to the amount of work we had to do. - Mọi việc kh&aacute;
        kh&oacute; khi t&ocirc;i mới bắt đầu học đại học bởi v&igrave; t&ocirc;i
        kh&ocirc;ng quen với số lượng c&ocirc;ng việc m&agrave; ch&uacute;ng
        t&ocirc;i phải l&agrave;m.
      </p>
      <p>
        - Soon I'll be used to driving in London and I won't be so frightened! -
        Sớm th&ocirc;i, t&ocirc;i sẽ quen với việc l&aacute;i xe ở London
        v&agrave; t&ocirc;i sẽ kh&ocirc;ng sợ h&atilde;i như thế nữa.
      </p>
      <p>
        <br /><strong>3. To get used to doing ( Get used to Ving)</strong
        ><br /><br />Cấu tr&uacute;c 'to get used to doing' được d&ugrave;ng để
        diễn tả qu&aacute; tr&igrave;nh diễn ra của 1 h&agrave;nh động đang dần
        trở th&agrave;nh th&oacute;i quen, quen thuộc đối với ch&uacute;ng
        ta.<br /><br /><strong>V&iacute; dụ: </strong>
      </p>
      <p>
        I didn't understand the accent when I first moved here but I quickly got
        used to it. (Lần đầu ti&ecirc;n chuyển đến đ&acirc;y, t&ocirc;i
        đ&atilde; kh&ocirc;ng hiểu được giọng n&oacute;i ở v&ugrave;ng
        n&agrave;y nhưng giờ t&ocirc;i đ&atilde; nhanh ch&oacute;ng quen dần với
        n&oacute;)
      </p>
      <p>
        She has started working nights and is still getting used to sleeping
        during the day. (C&ocirc; ấy bắt đầu l&agrave;m việc v&agrave;o ban
        đ&ecirc;m v&agrave; dần quen với việc ngủ suốt ng&agrave;y)
      </p>
      <h4>
        <span style="color: #ff0000"><strong>IV. WOULD</strong></span>
      </h4>
      <p>
        Ch&uacute;ng ta c&oacute; thể sử dụng 'would + infinitive' để n&oacute;i
        về một th&oacute;i quen v&agrave; một h&agrave;nh động lặp đi lặp lại
        v&agrave; thường xuy&ecirc;n xảy ra trong qu&aacute; khứ.
      </p>
      <p>
        Ch&uacute;ng ta c&ograve;n d&ugrave;ng 'would + infinitive' để kể 1
        c&acirc;u chuyện trong qu&aacute; khứ:
      </p>
      <ul>
        <li>
          When I was a student, we would often have a drink after class on a
          Friday.
        </li>
        <li>
          When I lived in Italy, we would go to a little restaurant near our
          house.
        </li>
      </ul>
      <p>
        Ch&uacute;ng ta kh&ocirc;ng d&ugrave;ng &ldquo;would&rdquo; với State
        verbs (động từ trạng th&aacute;i) ở qu&aacute; khứ: Would have l&agrave;
        kh&ocirc;ng được.
      </p>
      <hr />
      <br />
    </div>
  </body>
</html>
